tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

cask_args appdir: "/Applications", require_sha: true

brew "mas"                                          # https://github.com/mas-cli/mas (Mac App Store CLI)
brew "fish"                                         # Nice shell
brew "tig"                                          # https://jonas.github.io/tig/ (Terminal UI for Git)
brew "node"                                         # Node.js
brew "ssh-copy-id"                                  # Pass your RSA keys on remote server
brew "qmk-toolbox"                                  # Tools for flash QMK compatible keebs

cask "qlcolorcode"                                  # https://github.com/anthonygelibert/QLColorCode
cask "qlimagesize"                                  # https://github.com/Nyx0uf/qlImageSize
cask "qlmarkdown"                                   # https://github.com/toland/qlmarkdown
cask "qlstephen"                                    # https://github.com/whomwah/qlstephen (Plaint ]text files)
cask "qlvideo"                                      # https://github.com/Marginal/QLVideo
cask "quicklook-json"                               # http://www.sagtau.com/quicklookjson.html
cask "webpquicklook"                                # https://github.com/dchest/webp-quicklook

cask "setapp"                                        # https://go.setapp.com/invite/6thxftx0 (Alt AppStore by subscribe)
cask "little-snitch"                                 # https://www.obdev.at/products/littlesnitch/index.html
cask "google-chrome"
cask "firefox"
cask "iterm2"                                        # https://www.iterm2.com
cask "tunnelblick"                                   # https://www.tunnelblick.net
cask "visual-studio-code"                            # https://code.visualstudio.com
cask "alfred"                                        # https://www.alfredapp.com
cask "spotify"
cask "discord"
cask "figma"
cask "obs"
cask "epoccam"
cask "docker"                                        # https://www.dropbox.com
cask "docker-compose"
cask "logitech-options"
cask "notion"                                        # https://notion.so
cask "zoom"                                          # https://zoom.us
cask "philips-hue-sync"                              # https://www.philips.com/en-us/hue/
cask "protonvpn"                                     # https://protonvpn.com

cask "homebrew/cask-drivers/shureplus-motiv"         # Shure Motiv for MV microphones
cask "homebrew/cask-fonts/font-jetbrains-mono"       # Font for code

mas "Enpass",   id: 732710998                        # https://www.enpass.io
mas "Magnet",   id: 441258766                        # http://magnet.crowdcafe.com
mas "Telegram", id: 747648890
mas "Slack",    id: 803453959
