tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "mas"                                          # https://github.com/mas-cli/mas (Mac App Store CLI)
brew "tig"                                          # https://jonas.github.io/tig/ (Terminal UI for Git)
brew "node"                                         # NodeJS
brew "ssh-copy-id"                                  # Pass your RSA keys on remote server

cask "qlcolorcode"                                  # https://github.com/anthonygelibert/QLColorCode
cask "qlimagesize"                                  # https://github.com/Nyx0uf/qlImageSize
cask "qlmarkdown"                                   # https://github.com/toland/qlmarkdown
cask "qlstephen"                                    # https://github.com/whomwah/qlstephen (Plaint ]text files)
cask "qlvideo"                                      # https://github.com/Marginal/QLVideo
cask "quicklook-json"                               # http://www.sagtau.com/quicklookjson.html
cask "webpquicklook"                                # https://github.com/dchest/webp-quicklook

cask "little-snitch"                                 # https://www.obdev.at/products/littlesnitch/index.html
cask "docker"                                        # https://www.dropbox.com
cask "google-chrome"                       	         # https://www.tunnelblick.net
cask "iterm2"                                        # https://www.iterm2.com
cask "setapp"                                        # https://go.setapp.com/invite/6thxftx0 (Alt AppStore by subscribe)
cask "tunnelblick"                                   # https://www.tunnelblick.net
cask "visual-studio-code"                            # https://code.visualstudio.com
cask "homebrew/cask-versions/google-chrome-canary"   # https://www.google.ru/chrome/browser/canary.html
cask "homebrew/cask-versions/telegram-alpha"         # https://macos.telegram.org
cask "alfred"                                        # https://www.alfredapp.com
cask "disablemonitor"                                # https://github.com/Eun/DisableMonitor

cask "homebrew/cask-fonts/font-fira-code"            # https://github.com/tonsky/FiraCode Font with legatures for coding

mas "Enpass", id: 732710998                          # https://www.enpass.io
mas "Magnet", id: 441258766                          # http://magnet.crowdcafe.com
mas "Memo", id: 1212409035                           # http://memo-app.net (Good stiky memos on desktop like old MacOS widgets)
mas "Spark", id: 1176895641                          # https://sparkmailapp.com
mas "Wunderlist", id: 410628904                      # https://www.wunderlist.com
